      *---------------------------------------------------------
      * Source information
      * @@LIBRARY: GITTEST123
      * @@FILE: QRPGLESRC
      * @@MEMBER: AAA
      * @@TYPE: RPGLE
      * @@TEXT:
      *---------------------------------------------------------
     dasddadsadas
