      *---------------------------------------------------------
      * Source information
      * @@LIBRARY: GITTEST123
      * @@FILE: QRPGLESRC
      * @@MEMBER: ABB
      * @@TYPE: RPGLE
      * @@TEXT:
      *---------------------------------------------------------
     fddsffgdf
