      *---------------------------------------------------------
      * Source information
      * @@LIBRARY: GITTEST123
      * @@FILE: QRPGLESRC
      * @@MEMBER: BBBBBB
      * @@TYPE: RPGLE
      * @@TEXT:
      *---------------------------------------------------------
     dfjsaklsadjlkdkakd
