      *---------------------------------------------------------
      * Source information
      * @@LIBRARY: GITTEST123
      * @@FILE: QRPGLESRC
      * @@MEMBER: CCCC
      * @@TYPE: RPGLE
      * @@TEXT:
      *---------------------------------------------------------
     fff
