      *---------------------------------------------------------
      * Source information
      * @@LIBRARY: GITTEST123
      * @@FILE: QRPGLESRC
      * @@MEMBER: HELLO
      * @@TYPE: RPGLE
      * @@TEXT: Hello RPG App
      *---------------------------------------------------------
     **FREE
<<<<<<< HEAD
     **FREEMEE
     zzzzzzzzz
=======
     **FREEMEEzzz

>>>>>>> 28ea00658976fd94caa05f93316040469a8909b2
     Dcl-S text Char(92);
     Dcl-s sum int(3);

     text = 'sum is:';
     sum = 5 + 5;

     Dsply text;
     dsply %char(sum);

     *inlr=*on;
     Return;
