      *---------------------------------------------------------
      * Source information
      * @@LIBRARY: GITTEST123
      * @@FILE: QRPGLESRC
      * @@MEMBER: HELLO2
      * @@TYPE: RPGLE
      * @@TEXT: Hello RPG App 2
      *---------------------------------------------------------
     **FREE
     // This is a commentzzzzzzz
     Dcl-S text char(5);
          **FREE
     text = 'hello git again;

     dsply text;

     return;zzz
