      *---------------------------------------------------------
      * Source information
      * @@LIBRARY: GITTEST123
      * @@FILE: QRPGLESRC
      * @@MEMBER: HELLO2
      * @@TYPE: RPGLE
      * @@TEXT: Hello RPG App 2
      *---------------------------------------------------------
     **FREE

     Dcl-S text char(5);

     text = 'hello git again;

     dsply text;

     return;z
