      *---------------------------------------------------------
      * Source information
      * @@LIBRARY: GITTEST123
      * @@FILE: QRPGLESRC2
      * @@MEMBER: AAAAA
      * @@TYPE: RPGLE
      * @@TEXT: aaaaa member
      *---------------------------------------------------------
     fdsfdfdfds  dsaasd  sss   sss
